In [10]:
import numpy as np
import pandas as pd

In [5]:
file_path = "/workspaces/tir104/pandas/resource/data_with_nan.csv"
df = pd.read_csv(file_path)
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [7]:
type(df["col3"][0])

float

In [8]:
type(None)

NoneType

In [9]:
df["col2"].mean()

np.float64(28.5)

In [11]:
columns = ["col1", "col2", "col3"]
data = [
    ["test1", 13, np.nan],
    ["test2", 44, "aaa"],
    ["test3", np.nan, np.nan],
    [np.nan, np.nan, np.nan]
]

df3 = pd.DataFrame(data=data, columns=columns)
df3

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN

In [12]:
df["col1"].isnull()

0    False
1    False
2    False
3     True
4    False
5     True
Name: col1, dtype: bool

In [14]:
df[df["col1"].isnull()]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [15]:
df[df["col1"].notna()]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [16]:
df[df["col1"].isna()]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [19]:
df.dropna(how="all")

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [23]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [22]:
df.dropna(thresh=1)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [21]:
df.dropna(thresh=2)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
4  test5   NaN  bbb

In [24]:
df["col1"]

0    test1
1    test2
2    test3
3      NaN
4    test5
5      NaN
Name: col1, dtype: object

In [25]:
df["col1"].fillna("")

0    test1
1    test2
2    test3
3
4    test5
5
Name: col1, dtype: object

In [26]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [27]:
df["col2"].ffill()

0    13.0
1    44.0
2    44.0
3    44.0
4    44.0
5    44.0
Name: col2, dtype: float64

In [28]:
df["col3"].ffill()

0    NaN
1    aaa
2    aaa
3    aaa
4    bbb
5    bbb
Name: col3, dtype: object

In [30]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [29]:
df["col3"].bfill()

0    aaa
1    aaa
2    bbb
3    bbb
4    bbb
5    NaN
Name: col3, dtype: object